const collectivesData = {
    choreographic: `<h2>Хореографічний жанр</h2><ol>
        <li>Народний аматорський ансамбль танцю «ТЯСМИН» — Кам’янський БК.</li>
        <li>Зразковий аматорський ансамбль танцю «Вікторія» — Кам’янський БК.</li>
        <li>Народний аматорський ансамбль танцю «Звенигора» — Звенигородський ЦКД.</li>
        <li>Зразковий аматорський ансамбль танцю «Заспів» — Звенигородка.</li>
        <li>Народний аматорський ансамбль танцю «МРІЯ» — Ватутіне.</li>
        <li>Зразковий аматорський хореографічний ансамбль «СВІТЛАНА» — Ватутіне.</li>
        <li>Народний аматорський ансамбль танцю «ТАЛЬНІВЧАНКА» — Тальне.</li>
        <li>Зразковий аматорський ансамбль танцю «ЕКСПРЕСІЯ» — Тальне.</li>
        <li>Народний аматорський ансамбль танцю «ГЕРЦ» — Шпола.</li>
        <li>Зразковий аматорський ансамбль танцю «Едельвейс» — Шпола.</li>
    </ol>`,
    vocal: `<h2>Вокально-хоровий жанр</h2><ol>
        <li>Народна аматорська хорова капела — Звенигородка.</li>
        <li>Народний ансамбль народної пісні «ЗАСПІВ» — Звенигородка.</li>
        <li>Народний чоловічий вокальний ансамбль — Звенигородка.</li>
        <li>Народний аматорський хор — Моринці.</li>
        <li>Народний жіночий ансамбль «ВЕСНЯНКА» — Ватутіне.</li>
        <li>Народний аматорський хор «Відродження» — Ватутіне.</li>
        <li>Народний аматорський хор ветеранів праці — Ватутіне.</li>
    </ol>`,
    theatrical: `<h2>Театральний жанр</h2><ol>
        <li>Народний аматорський драматичний колектив — Звенигородка.</li>
        <li>Народний аматорський театр малих форм — Ватутіне.</li>
        <li>Народний аматорський драматичний колектив — Катеринопіль.</li>
        <li>Народний аматорський драматичний колектив — Лисянка.</li>
        <li>Народний аматорський драматичний колектив — Тальне.</li>
        <li>Народний аматорський театр мініатюр «СМІХОГРАЙ» — Жашків.</li>
    </ol>`,
    instrumental: `<h2>Музично-інструментальний</h2><ol>
        <li>Народний аматорський духовий оркестр — Звенигородка.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль — Тальне.</li>
        <li>Народний аматорський оркестр народних інструментів — Шпола.</li>
    </ol>`
};
