/**
 * collectives.js - Керування списками колективів (HTML формат)
 */

const collectivesData = {
    choreographic: `<h2>Хореографічний жанр</h2>
    <ol>
       <li>Народний аматорський ансамбль танцю «ТЯСМИН» — Кам’янський міський Будинок культури, Кам’янська міська громада. Керівник: Одуд Ганна Михайлівна.</li>
       <li>Зразковий аматорський ансамбль танцю «Вікторія» — Кам’янський міський Будинок культури, Кам’янська міська громада. Керівник: Ланго Вікторія Павлівна.</li>
       <li>Народний аматорський ансамбль танцю «Звенигора» — Звенигородський Центр культури і дозвілля ім. Т. Г. Шевченка, Звенигородська міська громада. Керівник: Олександр Мінько.</li>
       <li>Зразковий аматорський дитячий ансамбль танцю «Заспів» — Звенигородський Центр культури і дозвілля ім. Т. Г. Шевченка, Звенигородська міська громада. Керівник: Олександр Мінько.</li>
       <li>Народний аматорський ансамбль танцю «МРІЯ» — Міський Палац культури м. Багачеве, Багачевська міська громада. Керівник: Сивак Світлана Федорівна.</li>
       <li>Зразковий аматорський хореографічний ансамбль «СВІТЛАНА» — Міський Палац культури м. Багачеве, Багачевська міська громада. Керівник: Сивак Світлана Федорівна.</li>
       <li>Народний аматорський ансамбль танцю «ТАЛЬНІВЧАНКА» — Тальнівський міський Центр культури та дозвілля, Тальнівська міська громада. Керівник: Кульбаба Людмила Іванівна.</li>
       <li>Зразковий аматорський ансамбль танцю «ЕКСПРЕСІЯ» — Тальнівський міський Центр культури та дозвілля, Тальнівська міська громада. Керівник: Андрущенко Наталія Валеріївна.</li>
       <li>Народний аматорський ансамбль танцю «ГЕРЦ» — Шполянський Центр культури та дозвілля, Шполянська міська громада. Керівник: Козацький Анатолій.</li>
       <li>Зразковий аматорський ансамбль танцю «Едельвейс» — Шполянський Центр культури та дозвілля, Шполянська міська громада. Керівник: Гірчак Муза Миколаївна.</li>
       <li>Зразковий аматорський ансамбль танцю «СУЗІР’Я» — Золотоніський міський Будинок культури, Золотоніська міська громада. Керівник: Назарова Олена Леонідівна.</li>
       <li>Зразкова аматорська студія бального та естрадного танцю «Ясочка» — Золотоніський міський Будинок культури, Золотоніська міська громада. Керівник: Величко Світлана Миколаївна.</li>
       <li>Народний аматорський ансамбль танцю «СЛАВУТИЧ» — Чорнобаївський селищний Будинок культури, Чорнобаївська селищна громада. Керівник: Тарасенко Віталій Олександрович.</li>
       <li>Зразковий аматорський ансамбль танцю «ДИВОЦВІТ» — Драбівська селищна рада, Драбівська селищна громада. Керівник: Нестеренко Олена Сергіївна.</li>
       <li>Зразковий аматорський хореографічний колектив «БАРВИ» — Христинівська міська рада, Христинівська міська громада. Керівник: Лукінський Сергій Олександрович.</li>
       <li>Народний аматорський ансамбль танцю «РОВЕСНИК» — Уманський міський Будинок культури, Уманська міська громада. Керівник: Бакланова Ірина Миколаївна.</li>
       <li>Народний аматорський хореографічний колектив «СВИДІВЧАНКА» — с. Свидівок, Черкаська міська громада. Керівник: Пожар Ірина Володимирівна.</li>
       <li>Зразковий аматорський хореографічний колектив «АРАБЕСК» — Корсунь-Шевченківська міська громада. Керівник: Черняк Ольга Михайлівна.</li>
       <li>Зразковий аматорський хореографічний колектив «ЕДЕЛЬВЕЙС» — Леськівський Будинок культури, Леськівська сільська громада. Керівник: Буркацька Валентина Петрівна.</li>
       <li>Зразковий аматорський ансамбль танцю «БАРВИ» — Худяківський Будинок культури, Худяківська сільська громада. Керівник: Магльована Вікторія Юріївна.</li>
       <li>Зразковий аматорський ансамбль танцю «ПЕРЛИНКА» — Руськополянський Будинок культури, Руськополянська сільська громада. Керівник: Черненко Олена Володимирівна.</li>
       <li>Народний аматорський ансамбль бального танцю «НАДІЯ» — Смілянський міський Будинок культури, Смілянська міська громада. Керівник: Гетьман Аліна Геннадіївна.</li>
       <li>Народний аматорський ансамбль бального танцю «Роксолана» — Будинок культури ім. Шевченка, м. Сміла, Смілянська міська громада. Керівник: Галковська Катерина Миколаївна.</li>
       <li>Народний аматорський ансамбль сучасного танцю «ДІАМАНТ» — Смілянський міський Будинок культури, Смілянська міська громада. Керівник: Бондар Олександр Дем’янович.</li>
       <li>Народний аматорський театр хореографічних мініатюр «АРТАНІЯ» — Будинок культури ім. І. Кулика, Черкаська міська громада. Керівник: Рубан Анатолій Вікторович.</li>
       <li>Зразковий аматорський колектив сучасної хореографії «ІМПУЛЬС» — Будинок культури ім. І. Кулика, Черкаська міська громада. Керівник: Воронова Олена Володимирівна.</li>
       <li>Народний аматорський ансамбль бального танцю «АЛЕГРО» — Будинок культури ім. І. Кулика, Черкаська міська громада. Керівник: Неверовський Анатолій Миколайович.</li>
       <li>Народний аматорський хореографічний колектив «ІМПУЛЬС+» — Черкаський міський Палац молоді, Черкаська міська громада. Керівник: Воропай Людмила Миколаївна.</li>
       <li>Зразковий аматорський хореографічний колектив «ЛИБІДЬ» — Чигиринська міська рада, Чигиринська міська громада. Керівник: Владикіна Марина Володимирівна.</li>
       <li>Зразковий аматорський хореографічний колектив «ЕКСКЛЮЗИВ» — с. Тіньки, Чигиринська міська громада. Керівник: Костенко Лариса Іванівна.</li>
    </ol>`,

    vocal: `<h2>Вокально-хоровий жанр</h2>
    <ol>
        <li>Народна аматорська хорова капела — Звенигородський ЦКД, Звенигородська міська громада. Керівник: Добендо Вікторія Олександрівна.</li>
        <li>Народний вокальний ансамбль народної пісні «ЗАСПІВ» — м. Звенигородка, Звенигородська міська громада. Керівник: Калита Тетяна Григорівна.</li>
        <li>Народний аматорський чоловічий вокальний ансамбль — м. Звенигородка, Звенигородська міська громада. Керівник: Погорілий Сергій Вікторович.</li>
        <li>Народний аматорський хор — Моринський сільський БК, Моринська сільська громада. Керівник: Лапська Євдокія Миколаївна.</li>
        <li>Народний жіночий вокальний ансамбль «ВЕСНЯНКА» — м. Багачеве, Багачевська міська громада. Керівник: Матвійчук Ольга Олександрівна.</li>
        <li>Народний аматорський хор «Відродження» — м. Багачеве, Багачевська міська громада. Керівник: Россошенко Юлія Олександрівна.</li>
        <li>Народний аматорський хор ветеранів праці — м. Багачеве, Багачевська міська громада. Керівник: Лещенко Віктор Олександрович.</li>
        <li>Народний чоловічий вокальний ансамбль «ОБЕРІГ» — м. Багачеве, Багачевська міська громада. Керівник: Лещенко Віктор Олександрович.</li>
        <li>Народний аматорський хоровий колектив — Вільшанський ЦКД, Вільшанська селищна громада. Керівник: Радчук Микола Іванович.</li>
        <li>Народний чоловічий ансамбль «КАЛНИБОЛОТСЬКИЙ КУРІНЬ» — смт Катеринопіль, Катеринопільська селищна громада. Керівник: Сафтенко Василь Миколайович.</li>
        <li>Народний жіночий ансамбль «НОСТАЛЬГІЯ» — смт Катеринопіль, Катеринопільська селищна громада. Керівник: Кравченко Галина Вікторівна.</li>
        <li>Народний жіночий вокальний ансамбль «МЕЛОДІЯ» — смт Лисянка, Лисянська селищна громада. Керівник: Беляєва Світлана Вікторівна.</li>
        <li>Народний жіночий вокальний ансамбль «ГОРЛИЦЯ» — смт Лисянка, Лисянська селищна громада. Керівник: Цибульська Любов Миколаївна.</li>
        <li>Народний жіночий вокальний ансамбль «ГОРЛИЦЯ» — с. Матусів, Матусівська сільська громада. Керівник: Глек Анатолій Миколайович.</li>
        <li>Народне жіноче тріо «ЧАРІВНЕ НАМИСТО» — с. Матусів, Матусівська сільська громада. Керівник: Демиденко Надія Михайлівна.</li>
        <li>Народний аматорський хоровий колектив — с. Квітки, Корсунь-Шевченківська міська громада. Керівник: Косенко Володимир Вікторович.</li>
        <li>Народний жіночий ансамбль «ЛЮБАВА» — с. Селище, Корсунь-Шевченківська міська громада. Керівник: Ліщинський Василь Іванович.</li>
        <li>Народний аматорський хор «ЗЛАГОДА» — с. Сухини, Корсунь-Шевченківська міська громада. Керівник: Рокосуєва Галина Миколаївна.</li>
        <li>Народний ансамбль народної пісні «ОРДАНА» — Тальнівський БК, Тальнівська міська громада. Керівник: Луняка Людмила Григорівна.</li>
        <li>Народний жіночий ансамбль «ТАЛЬНІВЧАНКИ» — Тальнівський БК, Тальнівська міська громада. Керівник: Іщенко Алла Георгіївна.</li>
        <li>Народне вокальне тріо «ДОЖНИЦЯ» — Тальнівський БК, Тальнівська міська громада. Керівник: Тицькун Лідія Дмитрівна.</li>
        <li>Народний вокальний ансамбль «ДЖЕРЕЛА» — Тальнівський БК, Тальнівська міська громада. Керівник: Ноздровський Юрій Анатолійович.</li>
        <li>Народний вокальний гурт «НАДВЕЧІР’Я» — Тальнівський БК, Тальнівська міська громада. Керівник: Смолявський Леонтій Павлович.</li>
        <li>Зразкова вокально-хорова студія «СВЯТО» — Тальнівський БК, Тальнівська міська громада. Керівник: Фурса Ірина Валеріївна.</li>
        <li>Зразкова вокальна студія «СПІВАНОЧКИ» — с. Мошурів, Тальнівська міська громада. Керівник: Фурса Віталій Володимирович.</li>
        <li>Народний жіночий ансамбль «КАЛИНА» — с. Білашки, Тальнівська міська громада. Керівник: Цимбал Ярослав Сергійович.</li>
        <li>Народний ансамбль пісні «ЯБЛУНЕВИЙ ЦВІТ» — с. Криві Коліна, Тальнівська міська громада. Керівник: Довжук Василь Володимирович.</li>
        <li>Народна хорова капела — Шевченківська сільська рада, Шевченківська сільська громада. Керівник: Бошкова Каріне Гарніківна.</li>
        <li>Народний аматорський хор «ОБЕРІГ» — Шполянська міська громада (м. Шпола). Керівник: Чорногал Олена Володимирівна.</li>
        <li>Народний ансамбль камерного співу «ЕЛЕГІЯ» — Шполянська міська громада (м. Шпола). Керівник: Чорногал Олена Володимирівна.</li>
        <li>Народний ансамбль пісні «СПАДЩИНА» — Шполянська міська громада (с. Сигнаївка). Керівник: Лоцман Галина Григорівна.</li>
        <li>Народне вокальне тріо «ВІА ЛеДі» — Шполянська міська громада (м. Шпола). Керівник: Верба Вікторія Юріївна.</li>
        <li>Народний аматорський хор — Драбівська селищна громада. Керівник: Вихор Ганна Петрівна.</li>
        <li>Народний хор «КОЗАЦЬКА СЛАВА» — Драбівська селищна громада. Керівник: Кукса Ігор Олексійович.</li>
        <li>Народний ансамбль народної пісні «МАЛЬВИ» — Драбівська селищна громада. Керівник: Батечко Аліна Юріївна.</li>
        <li>Народний ансамбль ветеранів «ЖУРАВКА» — Драбівська селищна громада. Керівник: Сириця Ніна Іванівна.</li>
        <li>Народний вокальний гурт «ПЛЕЯДА» — Драбівська селищна громада. Керівник: Ошкало Катерина Михайлівна.</li>
        <li>Народний чоловічий гурт «ДЗВОНИ» — Драбівська селищна громада. Керівник: Ткаченко Валентин Миколайович.</li>
        <li>Народний ансамбль ветеранів «ОБЕРІГ» — Драбівська селищна громада. Керівник: Овсієнко Катерина Валеріївна.</li>
        <li>Народний хор духовної музики «ВОСКРЕСІННЯ» — Золотоніська міська громада. Керівник: Журба Тетяна Пилипівна.</li>
        <li>Народний ансамбль пісні і танцю «ЗАДНІПРЯНИ» — Золотоніська міська громада. Керівник: Гонза Євген Олексійович.</li>
        <li>Народний жіночий вокальний ансамбль «ЛЕБІДКА» — Золотоніська міська громада. Керівник: Камша Таїсія Ігорівна.</li>
        <li>Народний театр пісні «ЗОЛОТІ ВОРОТА» — Золотоніська міська громада. Керівник: Долгушина Вікторія Іванівна.</li>
        <li>Народний чоловічий вокальний ансамбль «СРІБНА КВАРТА» — Золотоніська міська громада. Керівник: Гонза Євген Олексійович.</li>
        <li>Народний молодіжний гурт «Black List» — Золотоніська міська громада. Керівник: Ярешко Анна Іванівна.</li>
        <li>Народний аматорський хор «ЖИВИЦЯ» — Іркліївська сільська громада. Керівник: Шепель Олег Анатолійович.</li>
        <li>Народний аматорський хор «СУПІЙЧАНИ» — Іркліївська сільська громада (с. Піщане). Керівник: Запора Олександр Васильович.</li>
        <li>Народний аматорський хор — Іркліївська сільська громада (с. Бубнівська Слобідка). Керівник: Ковтун Віталій Миколайович.</li>
        <li>Народний вокальний жіночий колектив «КУМАСЕНЬКИ» — Іркліївська сільська громада (с. Гладківщина). Керівник: Ковтун Віталій Миколайович.</li>
        <li>Народний хоровий колектив «ЖИТОГРАЙ» — Чорнобаївська селищна громада. Керівник: Нестеренко Василь Микитович.</li>
        <li>Народний хоровий колектив «ТЕРНИЦЯ» — Чорнобаївська селищна громада (с. Великі Канівці). Керівник: Фурса Галина Іллівна.</li>
        <li>Народний жіночий ансамбль «БЕРЕГИНЯ» — Чорнобаївська селищна громада (с. Великі Канівці). Керівник: Пащенко Юрій Васильович.</li>
        <li>Народний вокальний гурт «МАЛЬВИ» — Шрамківська сільська громада. Керівник: Кравченко Оксана Григорівна.</li>
        <li>Народний ансамбль пісні «КОВАЛІВЧАНКА» — Шрамківська сільська громада (с. Ковалівка). Керівник: Снісаревська Людмила Яківна.</li>
        <li>Народний хор «ТЕРНИЦЯ» — Дмитрушківська сільська громада. Керівник: Берднікова Світлана Олександрівна.</li>
        <li>Народний хор «Ветеран» — Жашківська міська громада. Керівник: Дубик Віктор Петрович.</li>
        <li>Народний аматорський хор — Жашківська міська громада. Керівник: Дубик Віктор Петрович.</li>
        <li>Народний чоловічий вокальний ансамбль — Жашківська міська громада. Керівник: Дубик Віктор Петрович.</li>
        <li>Народний жіночий ансамбль «ЖАШКІВЧАНКА» — Жашківська міська громада. Керівник: Гребенюк Володимир Якович.</li>
        <li>Народний хоровий колектив — Жашківська міська громада (Соколівська філія). Керівник: Поважнюк Олександр Васильович.</li>
        <li>Народний хоровий колектив «ГІРСЬКИЙ ТІКИЧ» — Жашківська міська громада (Бузівська філія). Керівник: Проценко Любов Володимирівна.</li>
        <li>Народне жіноче тріо «ГАРМОНІЯ» — Жашківська міська громада. Керівник: Гребенюк Володимир Якович.</li>
        <li>Народний хор ветеранів праці «ДЖЕРЕЛО» — Маньківська селищна громада. Керівник: Кожухар Сергій Петрович.</li>
        <li>Народний чоловічий ансамбль «КОЗАЦЬКА РАДА» — Маньківська селищна громада (с. Дзензелівка). Керівник: Кожухар Сергій Петрович.</li>
        <li>Народний хоровий колектив «РОДИНА» — Маньківська селищна громада (с. Дзензелівка). Керівник: Кожухар Сергій Петрович.</li>
        <li>Народний вокальний гурт «ПІЗНЯ ЗУСТРІЧ» — Маньківська селищна громада. Керівник: Левченко Алла Валеріївна.</li>
        <li>Народний хор ветеранів «НАДВЕЧІР’Я» — Монастирищенська міська громада. Керівник: Наказний Олександр Іванович.</li>
        <li>Народний хоровий колектив «Українське мереживо» — Монастирищенська міська громада. Керівник: Кудін Юрій Миколайович.</li>
        <li>Народний чоловічий ансамбль «МОНАСТИРИЩЕНСЬКІ КОЗАКИ» — Монастирищенська міська громада. Керівник: Магдич Петро Йосипович.</li>
        <li>Народний жіночий ансамбль «ЗЛАГОДА» — Монастирищенська міська громада. Керівник: Кудін Юрій Миколайович.</li>
        <li>Народний хоровий колектив — Уманська міська громада (с. Кочубіївка). Керівник: Макаренко Олександр Васильович.</li>
        <li>Народна хорова капела ветеранів «УМАНСЬКІ БАРВИ» — Уманська міська громада (м. Умань). Керівник: Рєхтіна Тетяна Василівна.</li>
        <li>Народний колектив пісні «ЛАСКАВО ПРОСИМО» — Христинівська міська громада. Керівник: Ковбасюк Раїса Яківна.</li>
        <li>Народний ансамбль пісні «ДИВОГРАЙ» — Балаклеївська сільська громада. Керівник: Присяжна Наталія Володимирівна.</li>
        <li>Народний вокальний ансамбль «СПІВАЙ ДУША» — Білозірська сільська громада. Керівник: Хоменко Ганна Андріївна.</li>
        <li>Зразкова вокальна студія «СЯЙВО» — Білозірська сільська громада. Керівник: Хоменко Ганна Андріївна.</li>
        <li>Народний вокальний колектив «ЛИТВИНЧАНКА» — Бобрицька сільська громада (с. Литвинець). Керівник: Гарник Олена Василівна.</li>
        <li>Народний аматорський хор «КАЛИНА» — Будищенська сільська громада (с. Будище). Керівник: Шевченко Сергій Михайлович.</li>
        <li>Народний ансамбль пісні і танцю «ОБЕРЕГИ» — Черкаська міська громада (с. Свидівок). Керівник: Коваль Станіслав Петрович.</li>
        <li>Народний хор ветеранів праці — Городищенська міська громада. Керівник: Градоблянський Володимир Іванович.</li>
        <li>Народний ансамбль пісні «Вільшанка» — Городищенська міська громада. Керівник: Градоблянський Володимир Іванович.</li>
        <li>Народний ансамбль пісні «МАЛЬВИ» — Городищенська міська громада. Керівник: Хачбулагян Ольга Володимирівна.</li>
        <li>Народний вокальний гурт «Ренет» — Городищенська міська громада. Керівник: Буравський Ігор Андрійович.</li>
        <li>Народний вокальний ансамбль «ВАЛЯВЧАНКА» — Городищенська міська громада (с. Валява). Керівник: Хачбулагян Ольга Володимирівна.</li>
        <li>Народний хор ветеранів праці — Кам’янська міська громада. Керівник: Яременко Марія Петрівна.</li>
        <li>Народний вокальний гурт «ЗОРЕЦВІТ» — Кам’янська міська громада. Керівник: Яременко Марія Петрівна.</li>
        <li>Народний вокальний ансамбль «БАРВИ» — Кам’янська міська громада. Керівник: Яременко Марія Петрівна.</li>
        <li>Народний хор «КОБЗАРЕВА КРИНИЦЯ» ім. І. Коваленка — Канівська міська громада. Керівник: Сторчоус Мар’яна Володимирівна.</li>
        <li>Зразковий театр естрадної пісні «НЕВГАМОВНІ» — Канівська міська громада. Керівник: Воюцька Вікторія Володимирівна.</li>
        <li>Народний колектив пісні «ЗОРЕЦВІТ» — Канівська міська громада. Керівник: Опанасевич Наталія Корніївна.</li>
        <li>Народний хор ветеранів праці — Корсунь-Шевченківська міська громада. Керівник: Квятківська Неля Віталіївна.</li>
        <li>Народний ансамбль пісні «ГОРИЦВІТ» — Корсунь-Шевченківська міська громада. Керівник: Даценко Леся Миколаївна.</li>
        <li>Народний чоловічий вокальний гурт «Манжари» — Корсунь-Шевченківська міська громада. Керівник: Калініченко Сергій Юрійович.</li>
        <li>Народний жіночий ансамбль «КУПАВА» — Корсунь-Шевченківська міська громада. Керівник: Дробот Каріна Василівна.</li>
        <li>Народний жіночий ансамбль «МРІЯ» — Корсунь-Шевченківська міська громада. Керівник: Усаченко Лариса Анатоліївна.</li>
        <li>Народний аматорський хор «ЛЕСЬКІВЧАННИ» — Леськівська сільська громада. Керівник: Жученко Олександр Миколайович.</li>
        <li>Народний ансамбль пісні «СУСІДИ» — Мліївська сільська громада (с. Райгород). Керівник: Попова Валентина Олександрівна.</li>
        <li>Народний жіночий ансамбль «МЛІЇВЧАНКА» — Мліївська сільська громада. Керівник: Милокост Катерина Григорівна.</li>
        <li>Народний хоровий колектив «МОШНОГОРИ» — Мошнівська сільська громада. Керівник: Полатайко Раїса Іванівна.</li>
        <li>Народний ансамбль народної пісні «МОЛОДИЧКИ МОЛОДІЇ» — Мошнівська сільська громада. Керівник: Полатайко Раїса Іванівна.</li>
        <li>Народний чоловічий ансамбль «ЯСНОГРАД» — Мошнівська сільська громада (с. Яснозір’я). Керівник: Демченко Іван Васильович.</li>
        <li>Народний аматорський хор «ЗІРЯНИ» — Мошнівська сільська громада (с. Яснозір’я). Керівник: Маніло Анатолій Васильович.</li>
        <li>Народний ансамбль пісні «Мальви» — Корсунь-Шевченківська міська громада (с. Деренковець). Керівник: Бардадим Микола Миколайович.</li>
        <li>Народний жіночий ансамбль «БІЛА КРИНИЦЯ» — Корсунь-Шевченківська міська громада (с. Макіївка). Керівник: Вовк Ванда Йосипівна.</li>
        <li>Народний фольклорно-етнографічний хор «ПОЛЯНИ» — Руськополянська сільська громада. Керівник: Стадник Олександр Іванович.</li>
        <li>Народний жіночий ансамбль «ПОЛЯНКА» — Руськополянська сільська громада (с. Геронимівка). Керівник: Локтєв Володимир Валентинович.</li>
        <li>Народний вокальний ансамбль «КОЛОРИТ» — Руськополянська сільська громада (с. Боровиця). Керівник: Третяк Валентина Станіславівна.</li>
        <li>Народний вокальний гурт «ДИВОЦВІТ» — Сагунівська сільська громада. Керівник: Лисохмара Любов Михайлівна.</li>
        <li>Народний хоровий колектив «ДЗВІНКА КРИНИЦЯ» — Смілянська міська громада. Керівник: Осадча Діна Іванівна.</li>
        <li>Народний аматорський хор «ГВОЗДИКА» — Смілянська міська громада. Керівник: Чабан Віктор Якович.</li>
        <li>Народний жіночий ансамбль «КОЛОРИТ» — Смілянська міська громада. Керівник: Бобошко Ірина Іванівна.</li>
        <li>Народний ансамбль народної пісні «БАРВИ» — Смілянська міська громада. Керівник: Козубенко Оксана Іванівна.</li>
        <li>Народний ансамбль козацької пісні «ЗАГРАВА» — Смілянська міська громада. Керівник: Пітенко Олена Федорівна.</li>
        <li>Народний аматорський хор «РОДОВІД» — Смілянська міська громада (мкр. Гречківка). Керівник: Хавринок Людмила Степанівна.</li>

        <li>Народний вокальний ансамбль «РОСИ» — Степанецька сільська громада (с. Степанці). Керівник: Козак Алла Вікторівна.</li>
        <li>Народний гурт пісні «РОДИНА» — Степанецька сільська громада (с. Степанки). Керівник: Смоквин Катерина Григорівна.</li>
        <li>Народний вокальний колектив «МЕЛОДІЯ ДУШІ» — Степанецька сільська громада (с. Головятине). Керівник: Мирошніченко Микола Борисович.</li>
        <li>Народний жіночий ансамбль «ПІСЕННЕ МЕРЕЖИВО» — Тернівська сільська громада. Керівник: Кривошея Світлана Миколаївна.</li>
        <li>Народний хоровий колектив «КАЛИНА» — Червонослобідська сільська громада. Керівник: Молдовець Юрій Олексійович.</li>
        <li>Народний ансамбль пісні «ДИВОЦВІТ» — Червонослобідська сільська громада (с. Вергуни). Керівник: Манько Олена Петрівна.</li>
        <li>Народний ансамбль пісні «Веселка» — Черкаська міська громада (БК ім. Кулика). Керівник: Супрун Наталія Василівна.</li>
        <li>Народний вокальний ансамбль «ЖАЙВІР» — Черкаська міська громада (БК ім. Кулика). Керівник: Іщенко Іван Сергійович.</li>
        <li>Народний аматорський хор — Чигиринська міська громада. Керівник: Тараненко Яків Іванович.</li>
        <li>Народне вокальне тріо «НАМИСТО» — Чигиринська міська громада. Керівник: Шнабський Олег Миколайович.</li>
        <li>Народний гурт пісні «КАЛИНА» — Чигиринська міська громада (с. Тіньки). Керівник: Каваценко Ніна Петрівна.</li>
        <li>Народний вокальний ансамбль «РОДИНА» — Чигиринська міська громада (с. Трушівці). Керівник: Зубенко Валентина Олексіївна.</li>
        <li>Хор ветеранів праці «Златограй» — Золотоніська міська громада. Керівник: Ковтун Віктор Миколайович.</li>
        <li>Аматорський вокально-хоровий гурт “Оберіг” — Корсунь-Шевченківська міська громада. Керівник: Сивокінь Світлана Іванівна.</li>
    </ol>`,

    theatrical: `<h2>Театральний жанр</h2>
    <ol>
        <li>Народний аматорський драматичний колектив — Звенигородський ЦКД. Керівник: Вельган Людмила Миколаївна.</li>
        <li>Народний аматорський театр малих форм — Ватутіне. Керівник: Чирва Тетяна Іванівна.</li>
        <li>Народний аматорський драматичний колектив — Катеринопіль. Керівник: Засунько Ірина Володимирівна.</li>
        <li>Народний аматорський драматичний колектив — Лисянка. Керівник: Олійник Світлана Вікторівна.</li>
        <li>Народний аматорський драматичний колектив — Тальне. Керівник: Солона Тетяна Сергіївна.</li>
        <li>Народний аматорський театр малих форм — Тальне. Керівник: Кашка Тамара Олександрівна.</li>
        <li>Народний аматорський драматичний колектив — с. Сигнаївка. Керівник: Кравченко Світлана Василівна.</li>
        <li>Народний аматорський драматичний колектив — Драбів. Керівник: Заболотня Надія Григорівна.</li>
        <li>Народний аматорський театр малих форм — Драбів. Керівник: Заболотня Надія Григорівна.</li>
        <li>Народний аматорський драматичний колектив — с. Пальміра. Керівник: Магда Ольга Іванівна.</li>
        <li>Народний аматорський драматичний колектив — Золотоноша. Керівник: Галат Світлана Віталіївна.</li>
        <li>Народний аматорський театр мініатюр «ЗАБАВА» — Шрамківка. Керівник: Цупро Юлія Леонідівна.</li>
        <li>Народний аматорський театр мініатюр «СМІХОГРАЙ» — Жашків. Керівник: Косенко Галина Григорівна.</li>
        <li>Народний аматорський драматичний колектив — Жашків. Керівник: Громова Оксана Юріївна.</li>
        <li>Народний аматорський драматичний колектив — Маньківка. Керівник: Кулик Олександр Борисович.</li>
        <li>Народний аматорський театральний колектив — Умань. Керівник: Мельник Тетяна Петрівна.</li>
        <li>Народний аматорський театр малих форм «Реверанс» — Умань. Керівник: Скибенко Марина Володимирівна.</li>
        <li>Народний аматорський театр — Христинівка. Керівник: Свіщенко Валентина Володимирівна.</li>
        <li>Народний аматорський театральний колектив «БЕРЕЗІЛЬ» — с. Березняки. Керівник: Левченко Оксана Миколаївна.</li>
        <li>Народний аматорський театр малих форм — Городище. Керівник: Лукашова Оксана Сергіївна.</li>
        <li>Народний аматорський театр мод «Vjshjvanka» — Городище. Керівник: Дорошенко Людмила Григорівна.</li>
        <li>Народний аматорський театр малих форм — Корсунь-Шевченківський. Керівник: Зоренко Валентина Миколаївна.</li>
        <li>Народний аматорський театр — с. Худяки. Керівник: Кошелко Валентина Миколаївна.</li>
        <li>Народний аматорський театр «ПЕРЕВЕСЛО» — Сміла. Керівник: Терещенко Любов Іванівна.</li>
        <li>Народний аматорський театр — Чигиринська міська рада. Керівник: Перевізник Світлана Іванівна.</li>
        <li>Народний аматорський театр малих форм — Чигирин. Керівник: Гришко Світлана Іванівна.</li>
        <li>Народний аматорський драматичний колектив — с. Богодухівка. Керівник: Міщенко Лідія Михайлівна.</li>
        <li>Народний аматорський драматичний колектив “Театрали” — с. Велика Бурімка. Керівник: Скачко Надія Михайлівна.</li>
        <li>Народний аматорський драматичний колектив “Етюд” — Катеринопіль. Керівник: Засунько Ірина Володимирівна.</li>
        <li>Народний аматорський театральний колектив “Брама” — Корсунь-Шевченківський. Керівник: Давиденко Тамара Петрівна.</li>
    </ol>`,

   instrumental: `<h2>Музично-інструментальний жанр</h2>
    <ol>
        <li>Народний аматорський вокально-інструментальний ансамбль — Звенигородський Центр культури і дозвілля ім. Т. Г. Шевченка. Керівник: Загорулько Дмитро Володимирович.</li>
        <li>Народний аматорський Біг-Бенд Михайла Панзюка — Ватутінський міський Палац культури. Керівник: Панзюк Михайло Степанович.</li>
        <li>Народний аматорський духовий оркестр — Ватутінський міський Палац культури. Керівник: Панзюк Михайло Степанович.</li>
        <li>Народний аматорський оркестр народних інструментів — Ватутінський міський Палац культури. Керівник: Геращенко Наталія Антонівна.</li>
        <li>Народна аматорська ретро-група «ХРОНОСКОП» — Ватутінський міський Палац культури. Керівник: Панзюк Михайло Степанович.</li>
        <li>Народний аматорський рок-гурт «ПОСТСКРИПТУМ» — Ватутінський міський Палац культури. Керівник: Сторожев Сергій Анатолійович.</li>
        <li>Народний аматорський духовий оркестр — Ризинський сільський БК Водяницької сільської ради. Керівник: Люшняк Анатолій Васильович.</li>
        <li>Народний аматорський оркестр народних інструментів — Катеринопільський Будинок культури. Керівник: Молоков Микола Георгійович.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «МАТУСЯНИ» — Матусівський сільський БК. Керівник: Сівак Володимир Євтропович.</li>
        <li>Народний аматорський духовий оркестр «СУРМИ ТАЛЬНІВЩИНИ» — Тальнівський Будинок культури. Керівник: Таран Володимир Леонідович.</li>
        <li>Народний аматорський колектив «ОТАМАНИ» — Тальнівський міський Центр культури та дозвілля. Керівник: Вовк Роман Миколайович.</li>
        <li>Народний аматорський духовий оркестр — філія с. Сигнаївка Шполянського ЦКД. Керівник: Лоцман Олександр Сергійович.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «Шанс» — Шполянський Центр культури та дозвілля. Керівник: Присяжний Юрій Володимирович.</li>
        <li>Народний аматорський ансамбль народної музики «ВЕЧОРНИЦІ» — Шполянський Центр культури та дозвілля. Керівник: Льовушкін Володимир Сергійович.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «СРІБНІ СТРУНИ» — Шполянський Центр культури та дозвілля. Керівник: Букарь Олександр Миронович.</li>
        <li>Народний аматорський духовий оркестр — Вознесенський сільський Будинок культури. Керівник: Новак Іван Іванович.</li>
        <li>Народний аматорський оркестр народних інструментів — ЦКД Драбівської селищної ради. Керівник: Дерновий Сергій Іванович.</li>
        <li>Зразковий аматорський інструментальний ансамбль «ГАРМОШЕЧКА» — ЦКД Драбівської селищної ради. Керівник: Сириця Василь Іванович.</li>
        <li>Народний аматорський колектив троїстих музик — ЦКД Драбівської селищної ради. Керівник: Белих Максим Юрійович.</li>
        <li>Народний аматорський ансамбль народних інструментів — Золотоніський міський Будинок культури. Керівник: Солдатова Катерина Степанівна.</li>
        <li>Народний аматорський духовий оркестр — Староковрайський БК Іркліївської сільської ради. Керівник: Однодворцев Аркадій Аркадійович.</li>
        <li>Народний аматорський духовий оркестр — Піщанський сільський Будинок культури. Керівник: Нестеренко Сергій Миколайович.</li>
        <li>Народний аматорський естрадно-духовий ансамбль «ВОДОГРАЙ» — Великоканівецький сільський БК. Керівник: Лещенко Павло Миколайович.</li>
        <li>Народний аматорський родинний колектив троїстих музик — Кононівський БК Шрамківської сільської ради. Керівник: Хіхло Анатолій Васильович.</li>
        <li>Народний аматорський духовий оркестр — Жашківський міський Будинок культури. Керівник: Мулик Дмитро Дмитрович.</li>
        <li>Народний аматорський духовий оркестр — Бузівська філія Жашківського міського БК. Керівник: Мулик Роман Дмитрович.</li>
        <li>Зразковий аматорський ансамбль гармоністів — Жашківський міський Будинок культури. Керівник: Сухий Іван Іванович.</li>
        <li>Народний аматорський духовий оркестр — Маньківський селищний Центр культури та дозвілля. Керівник: Лисюченко Петро Іванович.</li>
        <li>Народний аматорський інструментальний дует «КУМ БАЯН» — Маньківська дитяча школа мистецтв. Керівник: Кирилюк Володимир Васильович.</li>
        <li>Народний аматорський духовий оркестр — Іванівський БК Паланської сільської ради. Керівник: Омельчук Григорій Олексійович.</li>
        <li>Народний аматорський ансамбль українських народних інструментів — Уманський міський БК ім. Ю. К. Смолича. Керівник: Сауляк Владислав Вікторович.</li>
        <li>Народний аматорський оркестр народних інструментів «РУСЬ» — Уманський міський БК ім. Ю. К. Смолича. Керівник: Калабська Віра Степанівна.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «Самі Свої» — Городищенський міський Палац культури. Керівник: Подупейко Петро Миколайович.</li>
        <li>Народний аматорський духовий оркестр — Кам’янський міський Будинок культури. Керівник: Кравець Володимир Станіславович.</li>
        <li>Народний аматорський вокально-інструментальний гурт «ПЕРЛИНА» — Канівський міський Будинок культури. Керівник: Третьякова Юлія Анатоліївна.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «ФІЛОСОФІЯ СЕРЦЯ» — Канівський міський Будинок культури. Керівник: Литвин Євген Григорович.</li>
        <li>Народний аматорський ансамбль народної музики «ЗДОРОВЕНЬКІ БУЛИ» — Канівський міський Будинок культури. Керівник: Шевченко Петро Миколайович.</li>
        <li>Народний аматорський ансамбль народних інструментів «КОБЗА» — БК Корсунь-Шевченківської міської ради. Керівник: Тищенко Оксана Вікторівна.</li>
        <li>Народний аматорський духовий оркестр — Михайлівський сільський Будинок культури. Керівник: Крупський Петро Антонович.</li>
        <li>Народний аматорський ансамбль народної музики «БАЙБУЗІВСЬКІ ТРОЇСТІ» — Байбузівський БК Мошнівської сільської ради. Керівник: Маніло Анатолій Васильович.</li>
        <li>Народний аматорський ансамбль народних інструментів «САНЖАРИ» — Санжариський сільський клуб. Керівник: Гончаренко Василь Савович.</li>
        <li>Народний аматорський духовий оркестр — ЦКДС Чигиринської міської ради. Керівник: Дерновий Антон Віталійович.</li>
        <li>Аматорський інструментальний ансамбль «ТІНЧАНСЬКІ МУЗИКИ» — БК с. Тіньки Чигиринської міської ради. Керівник: Костенко Іван Петрович.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль “Дніпряни” — Чорнобаївський селищний Будинок культури. Керівник: Соська Віктор Петрович.</li>
        <li>Народний аматорський вокально-інструментальний ансамбль «Мікс» — Маньківський селищний Центр культури та дозвілля. Керівник: Шаповал Ярослав Анатолійович.</li>
    </ol>`
};

window.openGenre = function(genre) {
    const modal = document.getElementById('listModal');
    const body = document.getElementById('modalBody');
    if (modal && body && collectivesData[genre]) {
        body.innerHTML = collectivesData[genre];
        modal.style.display = 'flex';
        document.body.style.overflow = 'hidden';
    }
};

window.closeModal = function() {
    const modal = document.getElementById('listModal');
    if (modal) {
        modal.style.display = 'none';
        document.body.style.overflow = 'auto';
    }
};
