window.collectivesList = {
    "звенигородська": [
        "1. Народна аматорська хорова капела (Керівник: Добендо Вікторія Олександрівна)",
        "2. Народний аматорський вокальний ансамбль народної пісні «ЗАСПІВ» (Керівник: Калита Тетяна Григорівна)",
        "3. Народний аматорський чоловічий вокальний ансамбль (Керівник: Погорілий Сергій Вікторович)",
        "4. Народний аматорський хор (с. Моринці) (Керівник: Лапська Євдокія Миколаївна)",
        "5. Народний аматорський вокально-інструментальний ансамбль (Керівник: Загорулько Дмитро Володимирович)",
        "6. Народний аматорський театр малих форм «ДЗВІН» (Керівник: Барабанова Олександра Сергіївна)",
        "7. Народний аматорський театр малих форм «КОБЗАРІ» (с. Моринці) (Керівник: Кулик Альбіна Валеріївна)",
        "8. Народний аматорський ансамбль танцю «ЗВЕНИГОРА» (Керівник: Луценко Олександр Анатолійович)",
        "9. Народний аматорський фольклорно-обрядовий колектив «ЖУРАВКА» (Керівник: Ткаченко Світлана Михайлівна)",
        "10. Народний аматорський фольклорно-автентичний колектив «ВЕТЕРАНИ ПРАЦІ» (с. Вільховець) (Керівник: Погоріла Лариса Степанівна)"
    ],
    "багачівська": [ // Ватутінська громада
        "1. Народний аматорський жіночий вокальний ансамбль «ВЕСНЯНКА» (Керівник: Матвійчук Ольга Олександрівна)",
        "2. Народний аматорський хор «Відродження» (Керівник: Россошенко Юлія Олександрівна)",
        "3. Народний аматорський хор ветеранів праці (Керівник: Лещенко Віктор Олександрович)",
        "4. Народний аматорський чоловічий вокальний ансамбль «ОБЕРІГ» (Керівник: Лещенко Віктор Олександрович)",
        "5. Народний аматорський Біг-Бенд Михайла Панзюка (Керівник: Панзюк Михайло Степанович)",
        "6. Народний аматорський духовий оркестр (Керівник: Панзюк Михайло Степанович)",
        "7. Народний аматорський оркестр народних інструментів (Керівник: Геращенко Наталія Антонівна)",
        "8. Народна аматорська ретро-група «ХРОНОСКОП» (Керівник: Панзюк Михайло Степанович)",
        "9. Народний аматорський рок-гурт «ПОСТСКРИПТУМ» (Керівник: Сторожев Сергій Анатолійович)",
        "10. Зразковий аматорський театральний колектив «НА БІС» (Керівник: Красільнік Юлія Володимирівна)"
    ],
    "вільшанська": [
        "1. Народний аматорський хоровий колектив (Керівник: Радчук Микола Іванович)",
        "2. Зразковий аматорський хореографічний колектив «ОЛЬША» (Керівник: Каракай Валентина Юріївна)"
    ],
    "водяницька": [
        "1. Народний аматорський духовий оркестр (с. Ризине) (Керівник: Люшняк Анатолій Васильович)"
    ],
    "катеринопільська": [
        "1. Народний аматорський чоловічий вокальний ансамбль «КАЛНИБОЛОТСЬКИЙ КУРІНЬ» (Керівник: Сафтенко Василь Миколайович)",
        "2. Народний аматорський жіночий вокальний ансамбль «НОСТАЛЬГІЯ» (Керівник: Кравченко Галина Вікторівна)",
        "3. Народний аматорський оркестр народних інструментів (Керівник: Молоков Микола Георгійович)",
        "4. Народний аматорський фольклорний ансамбль «ПОТОЧАНОЧКА» (Керівник: Дудченко Тамара Миколаївна)"
    ],
    "лисянська": [
        "1. Народний аматорський жіночий вокальний ансамбль «МЕЛОДІЯ» (Керівник: Беляєва Світлана Вікторівна)",
        "2. Народний аматорський жіночий вокальний ансамбль «ГОРЛИЦЯ» (Керівник: Цибульська Любов Миколаївна)",
        "3. Зразковий аматорський ансамбль сучасного танцю «ЕДЕЛЬВЕЙС» (Керівник: Шпак Галина Іванівна)",
        "4. Народний аматорський фольклорний колектив «КРИНИЦЯ» (Керівник: Маленко Валентина Миколаївна)",
        "5. Народний аматорський фольклорний колектив «КАЛИНА» (с. Хижинці) (Керівник: Маленко Валентина Миколаївна)"
    ],
    "матусівська": [
        "1. Народний аматорський жіночий вокальний ансамбль «ГОРЛИЦЯ» (Керівник: Глек Анатолій Миколайович)",
        "2. Народне аматорське жіноче вокальне тріо «ЧАРІВНЕ НАМИСТО» (Керівник: Демиденко Надія Михайлівна)",
        "3. Народний аматорський вокально-інструментальний ансамбль «МАТУСЯНИ» (Керівник: Сівак Володимир Євтропович)"
    ],
    "мокрокалигірська": [
        "1. Народний аматорський фольклорний колектив «НАДВЕЧІР’Я» (Керівник: Говрас Тетяна Василівна)"
    ],
    "селищенська": [
        "1. Народний аматорський хоровий колектив (с. Квітки) (Керівник: Косенко Володимир Вікторович)",
        "2. Народний аматорський жіночий вокальний ансамбль «ЛЮБАВА» (Керівник: Ліщинський Василь Іванович)",
        "3. Народний аматорський хор «ЗЛАГОДА» (с. Сухини) (Керівник: Рокосуєва Галина Миколаївна)",
        "4. Народний аматорський театральний колектив (с. Квітки) (Керівник: Шпунтенко Станіслав Вікторович)",
        "5. Народний аматорський фольклорний колектив «ДЖЕРЕЛО» (Керівник: Супрун Олександр Анатолійович)",
        "6. Народний аматорський фольклорний колектив «ЗЕЛЕНА ДОЛИНА» (с. Квітки) (Керівник: Коваленко Катерина Петрівна)"
    ],
    "стеблівська": [
        "1. Народний аматорський фольклорний колектив «РОДИНА» (Керівник: Локтєва Юлія Іванівна)"
    ],
    "тальнівська": [
        "1. Народний аматорський ансамбль народної пісні «ОРДАНА» (Керівник: Луняка Людмила Григорівна)",
        "2. Народний аматорський жіночий вокальний ансамбль «ТАЛЬНІВЧАНКИ» (Керівник: Іщенко Алла Георгіївна)",
        "3. Народне аматорське вокальне тріо «ДОЖНИЦЯ» (Керівник: Тицькун Лідія Дмитрівна)",
        "4. Народний аматорський вокальний ансамбль «ДЖЕРЕЛА» (Керівник: Ноздровський Юрій Анатолійович)",
        "5. Народний аматорський вокальний гурт «НАДВЕЧІР’Я» (Керівник: Смолявський Леонтій Павлович)",
        "6. Зразкова аматорська вокально-хорова студія «СВЯТО» (Керівник: Фурса Ірина Валеріївна)",
        "7. Зразкова аматорська вокальна студія «СПІВАНОЧКИ» (с. Мошурів) (Керівник: Фурса Віталій Володимирович)",
        "8. Народний аматорський жіночий вокальний ансамбль «КАЛИНА» (с. Білашки) (Керівник: Цимбал Ярослав Сергійович)",
        "9. Народний аматорський ансамбль української пісні «ЯБЛУНЕВИЙ ЦВІТ» (с. Криві Коліна) (Керівник: Довжук Василь Володимирович)",
        "10. Народний аматорський духовий оркестр «СУРМИ ТАЛЬНІВЩИНИ» (Керівник: Таран Володимир Леонідович)",
        "11. Народний аматорський колектив «ОТАМАНИ» (Керівник: Вовк Роман Миколайович)",
        "12. Народний аматорський фольклорний колектив «ОРІЯНИ» (Керівник: Вовк Тетяна Миколаївна)",
        "13. Народна аматорська кіностудія «СТОЖАРИ» (Керівник: Смоквина Інна Юріївна)"
    ],
    "шевченківська": [
        "1. Народна аматорська хорова капела (Керівник: Бошкова Каріне Гарніківна)",
        "2. Народний аматорський театр (Керівник: Шепілова Аліна Василівна)",
        "3. Народний аматорський театр малих форм (Керівник: Лоскучерева Марія Іванівна)"
    ],
    "шполянська": [
        "1. Народний аматорський хор «ОБЕРІГ» (Керівник: Чорногал Олена Володимирівна)",
        "2. Народний аматорський ансамбль камерного співу «ЕЛЕГІЯ» (Керівник: Чорногал Олена Володимирівна)",
        "3. Народний аматорський ансамбль української пісні «СПАДЩИНА» (с. Сигнаївка) (Керівник: Лоцман Галина Григорівна)",
        "4. Народне аматорське вокальне тріо «ВІА ЛеДі» (Керівник: Верба Вікторія Юріївна)",
        "5. Народний аматорський духовий оркестр (с. Сигнаївка) (Керівник: Лоцман Олександр Сергійович)",
        "6. Народний аматорський вокально-інструментальний ансамбль «Шанс» (Керівник: Присяжний Юрій Володимирович)",
        "7. Народний аматорський ансамбль народної музики «ВЕЧОРНИЦІ» (Керівник: Льовушкін Володимир Сергійович)",
        "8. Народний аматорський вокально-інструментальний ансамбль «СРІБНІ СТРУНИ» (Керівник: Букарь Олександр Миронович)",
        "9. Народний аматорський театральний колектив (с. Надточаївка) (Керівник: Ропай Тетяна Михайлівна)",
        "10. Зразковий аматорський ансамбль сучасного танцю «ЕЛІТ» (Керівник: Осадчук Олеся Анатоліївна)",
        "11. Народний аматорський фольклорно-автентичний колектив «Барвінок» (с. Лебедин) (Керівник: Темненко Микола Григорович)",
        "12. Народний аматорський фольклорний ансамбль «Берегиня» (Керівник: Поліщук Лідія Степанівна)"
    ],
    "великохутірська": [
        "1. Народний аматорський фольклорний колектив «НАДВЕЧІР’Я» (Керівник: Коваль Михайло Дмитрович)"
    ],
    "вознесенська": [
        "1. Народний аматорський духовий оркестр (Керівник: Новак Іван Іванович)"
    ],
    "гельмязівська": [
        "1. Зразковий аматорський хореографічному колектив «РИТМ» (Керівник: Козачок Світлана Миколаївна)",
        "2. Народний аматорський фольклорний колектив «Калина» (Керівник: Лобунець Віра Миколаївна)"
    ],
    "драбівська": [
        "1. Народний аматорський хор (Керівник: Вихор Ганна Петрівна)",
        "2. Народний аматорський хор народної пісні «КОЗАЦЬКА СЛАВА» (Керівник: Кукса Ігор Олексійович)",
        "3. Народний аматорський ансамбль народної пісні «МАЛЬВИ» (Керівник: Батечко Аліна Юріївна)",
        "4. Народний аматорський жіночий вокальний ансамбль ветеранів «ЖУРАВКА» (Керівник: Сириця Ніна Іванівна)",
        "5. Народний аматорський вокальний гурт «ПЛЕЯДА» (Керівник: Ошкало Катерина Михайлівна)",
        "6. Народний аматорський вокальний чоловічий гурт «ДЗВОНИ» (Керівник: Ткаченко Валентин Миколайович)",
        "7. Народний аматорський вокальний ансамбль ветеранів праці «ОБЕРІГ» (Керівник: Овсієнко Катерина Валеріївна)",
        "8. Народний аматорський оркестр народних інструментів (Керівник: Дерновий Сергій Іванович)",
        "9. Зразковий аматорський інструментальний ансамбль «ГАРМОШЕЧКА» (Керівник: Сириця Василь Іванович)",
        "10. Народний аматорський колектив троїстих музик (Керівник: Белих Максим Юрійович)",
        "11. Зразковий аматорський ансамбль танцю «ДИВОЦВІТ» (Керівник: Нестеренко Олена Сергіївна)",
        "12. Народний аматорський колектив любителів старовинної пісні «СПАДЩИНА» (Керівник: Яценко Галина Кіндратівна)",
        "13. Народний аматорський фольклорно-автентичний колектив «РОДОВІД» (с. Білоусівка) (Керівник: Ткаченко Валентина Миколаївна)",
        "14. Народний аматорський фольклорний колектив «Павлівщаночка» (с. Павлівщина) (Керівник: Варення Марія Іванівна)"
    ],
    "золотоніська": [
        "1. Народний аматорський хор духової музики «ВОСКРЕСІННЯ» (Керівник: Журба Тетяна Пилипівна)",
        "2. Народний аматорський ансамбль пісні і танцю «ЗАДНІПРЯНИ» (Керівник: Гонза Євген Олексійович)",
        "3. Народний аматорський жіночий вокальний ансамбль «ЛЕБІДКА» (Керівник: Камша Таїсія Ігорівна)",
        "4. Народний аматорський театр пісні «ЗОЛОТІ ВОРОТА» (Керівник: Долгушина Вікторія Іванівна)",
        "5. Народний аматорський чоловічий вокальний ансамбль «СРІБНА КВАРТА» (Керівник: Гонза Євген Олексійович)",
        "6. Народний аматорський молодіжний вокальний гурт «Black List» (Керівник: Ярешко Анна Іванівна)",
        "7. Народний аматорський ансамбль народних інструментів (Керівник: Солдатова Катерина Степанівна)",
        "8. Народний аматорський театр (Керівник: Лада Ольга Іванівна)",
        "9. Зразкова аматорська студія бального та естрадного танцю «Ясочка» (Керівник: Величко Світлана Миколаївна)"
    ],
    "зорівська": [
        "1. Народний аматорський фольклорно-обрядовий колектив «ПРИДАНИ» (с. Вершина-Згар) (Керівник: Зубрицька Світлана Петрівна)"
    ],
    "іркліївська": [
        "1. Народний аматорський хор «ЖИВИЦЯ» (Керівник: Шепель Олег Анатолійович)",
        "2. Народний аматорський духовий оркестр (с. Старий Коврай) (Керівник: Однодворцев Аркадій Аркадійович)",
        "3. Народний аматорський фольклорно-автентичний колектив «КРИНИЦЯ» (с. Лящівка) (Керівник: Крючка Надія Олександрівна)"
    ],
    "піщанська": [
        "1. Народний аматорський хор «СУПІЙЧАНИ» (Керівник: Запора Олександр Васильович)",
        "2. Народний аматорський хор (с. Бубнівська Слобідка) (Керівник: Ковтун Віталій Миколайович)",
        "3. Народний аматорський вокальний жіночий колектив «КУМАСЕНЬКИ» (с. Гладківщина) (Керівник: Ковтун Віталій Миколайович)",
        "4. Народний аматорський духовий оркестр (Керівник: Нестеренко Сергій Миколайович)",
        "5. Народний аматорський театр малих форм (Керівник: Запора Ольга Григорівна)",
        "6. Народний аматорський ансамбль танцю «ЛЮБАВА» (Керівник: Шеремет Любов Петрівна)",
        "7. Народний аматорський фольклорно-автентичний колектив «СПАДЩИНА» (с. Бубнівська Слобідка) (Керівник: Гладка Катерина Яківна)"
    ],
    "чорнобаївська": [
        "1. Народний аматорський хоровий колектив «ЖИТОГРАЙ» (Керівник: Нестеренко Василь Микитович)",
        "2. Народний аматорський хоровий колектив «ТЕРНИЦЯ» (с. Великі Канівці) (Керівник: Фурса Галина Іллівна)",
        "3. Народний аматорський жіночий вокальний ансамбль «БЕРЕГИНЯ» (с. Великі Канівці) (Керівник: Пащенко Юрій Васильович)",
        "4. Народний аматорський естрадно-духовий ансамбль «ВОДОГРАЙ» (с. Великі Канівці) (Керівник: Лещенко Павло Миколайович)",
        "5. Народний аматорський фольклорний колектив «ВЕСЕЛІ МОЛОДИЧКИ» (с. Богодухівка) (Керівник: Черевань Тамара Миколаївна)"
    ],
    "шрамківська": [
        "1. Народний аматорський вокальний гурт «МАЛЬВИ» (с. Погреби) (Керівник: Кравченко Оксана Григорівна)",
        "2. Народний аматорський вокальний ансамбль української пісні «КОВАЛІВЧАНКА» (Керівник: Снісаревська Людмила Яківна)",
        "3. Народний аматорський родинний колектив троїстих музик (с. Кононівка) (Керівник: Хіхло Анатолій Васильович)",
        "4. Народний аматорський театр мініатюр «ЗАБАВА» (Керівник: Цупро Юлія Леонідівна)",
        "5. Народний аматорський фольклорно-автентичний колектив «МАТЕРИНСЬКА ПІСНЯ» (с. Степанівка) (Керівник: Кочума Світлана Олександрівна)",
        "6. Народний аматорський родинний ансамбль «РОЗРАДА» (с. Степанівка) (Керівник: Король Микола Григорович)",
        "7. Народний аматорський фольклорно-автентичний колектив «НАДІЯ» (с. Мойсівка) (Керівник: Лисенко Світлана Федорівна)",
        "8. Народний аматорський фольклорно-автентичний колектив «КАЛИНОВА РОДИНА» (с. Кантакузівка) (Керівник: Петреченко Ніна Миколаївна)",
        "9. Народний аматорський фольклорний колектив «ДЖЕРЕЛО» (Керівник: Буряченко Олена Леонідівна)",
        "10. Народний аматорський фольклорно-обрядовий колектив «Свашечки» (с. Вишневе) (Керівник: Христенко Анна Василівна)"
    ],
    "дмитрушківська": [
        "1. Народний аматорський хор «ТЕРНИЦЯ» (Керівник: Берднікова Світлана Олександрівна)"
    ],
    "жашківська": [
        "1. Народний аматорський хор «Ветеран» (Керівник: Дубик Віктор Петрович)",
        "2. Народний аматорський хор (МБК) (Керівник: Дубик Віктор Петрович)",
        "3. Народний аматорський чоловічий вокальний ансамбль (Керівник: Дубик Віктор Петрович)",
        "4. Народний аматорський жіночий вокальний ансамбль «ЖАШКІВЧАНКА» (Керівник: Гребенюк Володимир Якович)",
        "5. Народний аматорський хоровий колектив (с. Соколівка) (Керівник: Поважнюк Олександр Васильович)",
        "6. Народний аматорський хоровий колектив «ГІРСЬКИЙ ТІКИЧ» (с. Бузівка) (Керівник: Проценко Любов Володимирівна)",
        "7. Народне аматорське жіноче вокальне тріо «ГАРМОНІЯ» (Керівник: Гребенюк Володимир Якович)",
        "8. Народний аматорський духовий оркестр (Керівник: Мулик Дмитро Дмитрович)",
        "9. Народний аматорський духовий оркестр (с. Бузівка) (Керівник: Мулик Роман Дмитрович)",
        "10. Зразковий аматорський ансамбль гармоністів (Керівник: Сухий Іван Іванович)",
        "11. Зразковий аматорський хореографічний колектив «ВЕСЕЛКА» (Керівник: Громова Тетяна Яківна)",
        "12. Народний аматорський фольклорно-автентичний колектив «КАЛИНОНЬКА» (с. Тетерівка) (Керівник: Білозір Ігор Олександрович)",
        "13. Народний аматорський фольклорний колектив «СПАДЩИНА» (Керівник: Рибаченко Катерина Миколаївна)",
        "14. Народний аматорський фольклорний колектив «ЖАЙВІР» (с. Соколівка) (Керівник: Поважнюк Олександр Васильович)"
    ],
    "іваньківська": [
        "1. Народний аматорський фольклорно-обрядовий колектив «ІВАНЧАНКА» (Керівник: Баранов Віктор Григорович)"
    ],
    "ладижинська": [
        "1. Зразковий аматорський хореографічний колектив «ВІКТОРІЯ» (Керівник: Юрійчук Оксана Сергіївна)"
    ],
    "маньківська": [
        "1. Народний аматорський хоровий колектив ветеранів праці «ДЖЕРЕЛО» (Керівник: Кожухар Сергій Петрович)",
        "2. Народний аматорський чоловічий вокальний ансамбль «КОЗАЦЬКА РАДА» (с. Дзензелівка) (Керівник: Кожухар Сергій Петрович)",
        "3. Народний аматорський хоровий колектив «РОДИНА» (с. Дзензелівка) (Керівник: Кожухар Сергій Петрович)",
        "4. Народний аматорський вокальний гурт «ПІЗНЯ ЗУСТРІЧ» (Керівник: Левченко Алла Валеріївна)",
        "5. Народний аматорський духовий оркестр (Керівник: Лисюченко Петро Іванович)",
        "6. Народний аматорський інструментальний дует «КУМ БАЯН» (Керівник: Кирилюк Володимир Васильович)",
        "7. Народний аматорський театральний колектив «РЕНЕСАНС» (Керівник: Потапенко Микола Олександрович)"
    ],
    "монастирищенська": [
        "1. Народний аматорський хор ветеранів праці «НАДВЕЧІР’Я» (Керівник: Наказний Олександр Іванович)",
        "2. Народний аматорський хоровий колектив «Українське мереживо» (Керівник: Кудін Юрій Миколайович)",
        "3. Народний аматорський чоловічий вокальний ансамбль «МОНАСТИРИЩЕНСЬКІ КОЗАКИ» (Керівник: Магдич Петро Йосипович)",
        "4. Народний аматорський жіночий вокальний ансамбль «ЗЛАГОДА» (Керівник: Кудін Юрій Миколайович)"
    ],
    "паланська": [
        "1. Народний аматорський хоровий колектив (с. Кочубіївка) (Керівник: Макаренко Олександр Васильович)",
        "2. Народний аматорський духовий оркестр (с. Іванівка) (Керівник: Омельчук Григорій Олексійович)"
    ]
};
