window.collectivesList = {
    // === ЗВЕНИГОРОДСЬКИЙ РАЙОН ===
    "звенигородська": [
        "1. Народна аматорська хорова капела. Керівник: Добендо Володимир Олександрович",
        "2. Народний аматорський вокальний ансамбль «ЗАСПІВ». Керівник: Калита Тетяна Григорівна",
        "3. Народний аматорський чоловічий вокальний ансамбль. Керівник: Погорілий Сергій Вікторович",
        "4. Народний аматорський хор (с. Моринці). Керівник: Лапська Євгенія Миколаївна",
        "5. Народний аматорський вокально-інструментальний ансамбль. Керівник: Загорулько Дмитро Володимирович",
        "6. Народний аматорський театр малих форм «ДЗВІН». Керівник: Барабанова Олена Сергіївна",
        "7. Народний аматорський театр малих форм «КОБЗАРІ» (с. Моринці). Керівник: Кулик Анатолій Васильович",
        "8. Народний аматорський ансамбль танцю «ЗВЕНИГОРА». Керівник: Луценко Олександр Анатолійович",
        "9. Народний аматорський фольклорно-обрядовий колектив «ЖУРАВКА». Керівник: Ткаченко Світлана Миколаївна",
        "10. Народний аматорський фольклорно-автентичний колектив «ВЕТЕРАНИ ПРАЦІ» (с. Вільховець). Керівник: Погоріла Лідія Степанівна"
    ],
    "багачівська": [ // Ватутінська громада
        "1. Народний аматорський жіночий вокальний ансамбль «ВЕСНЯНКА». Керівник: Россошенко Юлія Олександрівна",
        "2. Народний аматорський хор «Відродження». Керівник: Россошенко Юлія Олександрівна (ЗМІНЕНО НАЗВУ)",
        "3. Народний аматорський хор ветеранів праці. Керівник: Лещенко Василь Олексійович",
        "4. Народний аматорський чоловічий вокальний ансамбль «ОБЕРІГ». Керівник: Шарова Людмила Олександрівна",
        "5. Народний аматорський Біг-Бенд Михайла Панзюка. Керівник: Панзюк Михайло Степанович (ЗМІНЕНО НАЗВУ)",
        "6. Народний аматорський духовий оркестр. Керівник: Панзюк Михайло Степанович",
        "7. Народний аматорський оркестр народних інструментів. Керівник: Панзюк Михайло Степанович",
        "8. Народна аматорська ретро-група «ХРОНОСКОП». Керівник: Маніло Ігор Миколайович",
        "9. Народний аматорський рок-гурт «ПОСТСКРИПТУМ». Керівник: Пономаренко Богдан Олександрович",
        "10. Зразковий аматорський театральний колектив «НА БІС». Керівник: Лук’яненко Світлана Валеріївна"
    ],
    "вільшанська": [
        "1. Народний аматорський хоровий колектив. Керівник: Радчук Микола Іванович",
        "2. Зразковий аматорський хореографічний колектив «ОЛЬША». Керівник: Тимченко Вікторія Віталіївна",
        "3. Зразкова аматорська театральна студія «Аrt studio». Керівник: Кіріязі Ірина Віталіївна (ПРИСВОЄНО)"
    ],
    "катеринопільська": [
        "1. Народний аматорський чоловічий вокальний ансамбль «КАЛНИБОЛОТСЬКИЙ КУРІНЬ». Керівник: Косенко Віктор Олександрович",
        "2. Народний аматорський жіночий вокальний ансамбль «НОСТАЛЬГІЯ». Керівник: Косенко Віктор Олександрович",
        "3. Народний аматорський оркестр народних інструментів. Керівник: Молоков Михайло Григорович",
        "4. Народний аматорський фольклорний ансамбль «ПОТОЧАНОЧКА». Керівник: Поліщук Світлана Віталіївна",
        "5. Народний аматорський драматичний колектив «Етюд». Керівник: Засунько Ірина Володимирівна (ПРИСВОЄНО)",
        "6. Зразковий аматорський хореографічний колектив «Dancing Stars». Керівник: Дробна Євгенія Юріївна (ПРИСВОЄНО)"
    ],
    "лисянська": [
        "1. Народний аматорський жіночий вокальний ансамбль «МЕЛОДІЯ». Керівник: Барабан Людмила Петрівна",
        "2. Народний аматорський жіночий вокальний ансамбль «ГОРЛИЦЯ». Керівник: Крамаренко Наталія Володимирівна",
        "3. Зразковий аматорський ансамбль сучасного танцю «ЕДЕЛЬВЕЙС». Керівник: Ляшенко Маргарита Дмитрівна",
        "4. Народний аматорський фольклорний колектив «КРИНИЦЯ». Керівник: Кравченко Ганна Федотівна",
        "5. Народний аматорський фольклорний колектив «КАЛИНА» (с. Хижинці). Керівник: Гордієнко Катерина Гнатівна",
        "6. Народний аматорський вокальний колектив «Джерело». Керівник: Славінська Галина Олександрівна (ПРИСВОЄНО)"
    ],
    "тальнівська": [
        "1. Народний аматорський ансамбль народної пісні «ОРДАНА». Керівник: Сошинська Тетяна Анатоліївна",
        "2. Народний аматорський жіночий вокальний ансамбль «ТАЛЬНІВЧАНКИ». Керівник: Полтавець Наталія Анатоліївна",
        "3. Народний аматорський духовий оркестр «СУРМИ ТАЛЬНІВЩИНИ». Керівник: Кульбіда Петро Лукич",
        "4. Народний аматорський колектив «ОТАМАНИ». Керівник: Полтавець Наталія Анатоліївна",
        "5. Народна аматорська кіностудія «СТОЖАРИ». Керівник: Павленко Валентина Андріївна",
        "6. Народний аматорський ансамбль української пісні «ЯБЛУНЕВИЙ ЦВІТ» (с. Криві Коліна). Керівник: Довжук Василь Володимирович (ЗМІНЕНО НАЗВУ)"
    ],

    // === ЗОЛОТОНІСЬКИЙ РАЙОН ===
    "драбівська": [
        "1. Народний аматорський хор. Керівник: Вихор Григорій Петрович",
        "2. Народний аматорський хор народної пісні «КОЗАЦЬКА СЛАВА». Керівник: Кукса Ігор Олексійович (ЗМІНЕНО ПРИНАЛЕЖНІСТЬ)",
        "3. Народний аматорський оркестр народних інструментів. Керівник: Дерновий Сергій Іванович (ЗМІНЕНО ПРИНАЛЕЖНІСТЬ)",
        "4. Зразковий аматорський ансамбль танцю «ДИВОЦВІТ». Керівник: Нестеренко Олена Сергіївна (ЗМІНЕНО ПРИНАЛЕЖНІСТЬ)"
    ],
    "золотоніська": [
        "1. Народний аматорський хор духової музики «ВОСКРЕСІННЯ». Керівник: Мальцев Олександр Васильович",
        "2. Народний аматорський театр. Керівник: Лада Олена Ігорівна",
        "3. Зразкова аматорська студія бального та естрадного танцю «Ясочка». Керівник: Величко Світлана Миколаївна (ЗМІНЕНО НАЗВУ)",
        "4. Народний аматорський хор ветеранів праці «Златограй». Керівник: Ковтун Віктор Миколайович (ПРИСВОЄНО)"
    ],
    "іркліївська": [
        "1. Народний аматорський хор «ЖИВИЦЯ». Керівник: Мисан Петро Іванович",
        "2. Народний аматорський фольклорно-автентичний колектив «КРИНИЦЯ». Керівник: Савельєва Ольга Володимирівна",
        "3. Народний аматорський вокальний ансамбль «Шумовиця». Керівник: Сучко Інна Петрівна (ПРИСВОЄНО)"
    ],
    "чорнобаївська": [
        "1. Народний аматорський хоровий колектив «ЖИТОГРАЙ». Керівник: Крячко Павло Миколайович",
        "2. Народний аматорський драматичний колектив (с. Богодухівка). Керівник: Міщенко Лідія Михайлівна (ПРИСВОЄНО)",
        "3. Народний аматорський драматичний колектив «Театрали» (с. Велика Бурімка). Керівник: Скачко Надія Михайлівна (ПРИСВОЄНО)",
        "4. Народний аматорський вокально-інструментальний ансамбль «Дніпряни». Керівник: Соська Віктор Петрович (ПРИСВОЄНО)"
    ],

    // === УМАНСЬКИЙ РАЙОН ===
    "жашківська": [
        "1. Народний аматорський хор «Ветеран». Керівник: Дубик Віктор Петрович",
        "2. Зразковий аматорський ансамбль гармоністів. Керівник: Сухий Іван Іванович",
        "3. Зразковий аматорський хореографічний колектив «ONYX». Керівник: Горобець Антоніна Андріївна (ПРИСВОЄНО)"
    ],
    "маньківська": [
        "1. Народний аматорський хоровий колектив «ДЖЕРЕЛО». Керівник: Мартинюк Михайло Савович",
        "2. Народний аматорський театральний колектив «РЕНЕСАНС». Керівник: Сичик Людмила Павлівна",
        "3. Народний аматорський вокально-інструментальний ансамбль «Мікс». Керівник: Шаповал Ярослав Анатолійович (ПРИСВОЄНО)",
        "4. Зразковий аматорський хореографічний колектив «Соняшник». Керівник: Мандра Олена Сергіївна (ПРИСВОЄНО)"
    ],

    // === ЧЕРКАСЬКИЙ РАЙОН ===
    "балаклеївська": [
        "1. Народний аматорський ансамбль української пісні «ДИВОГРАЙ». Керівник: Присяжна Наталія Володимирівна",
        "2. Народний аматорський фольклорний ансамбль «БУДКІВЧАНКА». Керівник: Проценко Галина Іванівна",
        "3. Народний аматорський фольклорний ансамбль «Журавка». Керівник: Задорожна Галина Леонідівна"
    ],
    "березняківська": [
        "1. Народний аматорський театральний колектив «БЕРЕЗІЛЬ». Керівник: Левченко Оксана Миколаївна"
    ],
    "білозірська": [
        "1. Народний аматорський вокальний ансамбль «СПІВАЙ ДУША». Керівник: Хоменко Ганна Андріївна",
        "2. Зразкова аматорська вокальна студія «СЯЙВО». Керівник: Хоменко Ганна Андріївна",
        "3. Зразкова аматорська студія танцю «ГРАЦІЯ». Керівник: Невгод Владислава Віталіївна"
    ],
    "будищенська": [
        "1. Народний аматорський хор «КАЛИНА» (с. Будище). Керівник: Шевченко Сергій Михайлович",
        "2. Народний аматорський ансамбль пісні і танцю «ОБЕРЕГИ» (с. Свидівок). Керівник: Коваль Станіслав Петрович",
        "3. Народний аматорський хореографічний колектив «СВИДІВЧАНКА». Керівник: Пожар Ірина Володимирівна"
    ],
    "городищенська": [
        "1. Народний аматорський хор ветеранів праці. Керівник: Градоблянський Володимир Іванович",
        "2. Народний аматорський ансамбль пісні «Вільшанка». Керівник: Градоблянський Володимир Іванович",
        "3. Народний аматорський ансамбль української пісні «МАЛЬВИ». Керівник: Хачбулагян Ольга Володимирівна",
        "4. Народний аматорський вокальний гурт «Ренет». Керівник: Буравський Ігор Андрійович",
        "5. Народний аматорський вокальний ансамбль «ВАЛЯВЧАНКА». Керівник: Хачбулагян Ольга Володимирівна",
        "6. Народний аматорський театр малих форм. Керівник: Лукашова Оксана Сергіївна",
        "7. Народний аматорський вокально-інструментальний ансамбль «Самі Свої». Керівник: Подупейко Петро Миколайович",
        "8. Народний аматорський театр мод «Vjshjvanka». Керівник: Дорошенко Людмила Григорівна",
        "9. Народний аматорський ансамбль української пісні «Вербиченька» (с. Хлистунівка). Керівник: Чеканова Марина Леонідівна (ПРИСВОЄНО)"
    ],
    "кам’янська": [
        "1. Народний аматорський хор ветеранів праці. Керівник: Яременко Марія Петрівна",
        "2. Народний аматорський вокальний гурт «ЗОРЕЦВІТ». Керівник: Яременко Марія Петрівна",
        "3. Народний аматорський вокальний ансамбль «БАРВИ». Керівник: Яременко Марія Петрівна",
        "4. Народний аматорський духовий оркестр. Керівник: Кравець Володимир Станіславович",
        "5. Зразковий аматорський ансамбль танцю «Вікторія». Керівник: Ланго Вікторія Павлівна",
        "6. Народний аматорський камерний хор «Кам'янка». Керівник: Бондаренко Світлана Сергіївна (ПРИСВОЄНО)",
        "7. Народний аматорський вокальний гурт «Ліра» (с. Косарі). Керівник: Юрченко Тетяна Миколаївна (ПРИСВОЄНО)"
    ],
    "канівська": [
        "1. Народний аматорський хор «КОБЗАРЕВА КРИНИЦЯ». Керівник: Сторчоус Мар’яна Володимирівна",
        "2. Зразковий аматорський театр сучасної естрадної пісні «НЕВГАМОВНІ». Керівник: Воюцька Вікторія Володимирівна",
        "3. Народний аматорський вокально-хоровий колектив «ЗОРЕЦВІТ». Керівник: Опанасевич Наталія Корніївна (ЗМІНЕНО НАЗВУ)",
        "4. Народний аматорський вокально-інструментальний гурт «ПЕРЛИНА». Керівник: Третьякова Юлія Анатоліївна",
        "5. Народний аматорський вокально-інструментальний ансамбль «ФІЛОСОФІЯ СЕРЦЯ». Керівник: Литвин Євген Григорович",
        "6. Народний аматорський ансамбль народної музики «ЗДОРОВЕНЬКІ БУЛИ». Керівник: Шевченко Петро Миколайович"
    ],
    "корсунь-шевченківська": [
        "1. Народний аматорський хор ветеранів праці. Керівник: Квятківська Неля Віталіївна",
        "2. Народний аматорський ансамбль української пісні «ГОРИЦВІТ». Керівник: Даценко Леся Миколаївна",
        "3. Народний аматорський чоловічий вокальний гурт «Манжари». Керівник: Калініченко Сергій Юрійович",
        "4. Народний аматорський жіночий вокальний ансамбль «КУПАВА». Керівник: Дробот Каріна Василівна",
        "5. Народний аматорський жіночий вокальний ансамбль «МРІЯ». Керівник: Усаченко Лариса Анатоліївна",
        "6. Народний аматорський ансамбль народних інструментів «КОБЗА». Керівник: Тищенко Оксана Вікторівна",
        "7. Зразковий аматорський хореографічний колектив «АРАБЕСК». Керівник: Черняк Ольга Михайлівна",
        "8. Народний аматорський театр малих форм. Керівник: Зоренко Валентина Миколаївна",
        "9. Народний аматорський театральний колектив «Брама». Керівник: Давиденко Тамара Петрівна (ПРИСВОЄНО)",
        "10. Народний аматорський вокально-хоровий гурт «Оберіг». Керівник: Сивокінь Світлана Іванівна (ПРИСВОЄНО)"
    ],
    "набутівська": [
        "1. Народний аматорський ансамбль української пісні «Мальви» (с. Деренковець). Керівник: Бардадим Микола Миколайович",
        "2. Народний аматорський вокальний ансамбль «Дівочі гори» (с. Сахнівка). Керівник: Шпилько Надія Михайлівна (ПРИСВОЄНО)"
    ],
    "руськополянська": [
        "1. Народний аматорський фольклорно-етнографічний хор «ПОЛЯНИ». Керівник: Стадник Олександр Іванович",
        "2. Народний аматорський жіночий вокальний ансамбль «ПОЛЯНКА». Керівник: Локтєв Володимир Валентинович",
        "3. Зразковий аматорський ансамбль танцю «ПЕРЛИНКА». Керівник: Черненко Олена Володимирівна"
    ],
    "смілянська": [
        "1. Народний аматорський хоровий колектив «ДЗВІНКА КРИНИЦЯ». Керівник: Осадча Діна Іванівна",
        "2. Народний аматорський хор «ГВОЗДИКА». Керівник: Чабан Віктор Якович",
        "3. Народний аматорський жіночий вокальний ансамбль «КОЛОРИТ». Керівник: Бобошко Ірина Іванівна",
        "4. Народний аматорський ансамбль народної пісні «БАРВИ». Керівник: Козубенко Оксана Іванівна",
        "5. Народний аматорський ансамбль козацької пісні «ЗАГРАВА». Керівник: Пітенко Олена Федорівна",
        "6. Народний аматорський хор «РОДОВІД». Керівник: Хавринок Людмила Степанівна",
        "7. Народний аматорський театр «ПЕРЕВЕСЛО». Керівник: Терещенко Любов Іванівна",
        "8. Народний аматорський ансамбль бального танцю «НАДІЯ». Керівник: Гетьман Аліна Геннадіївна",
        "9. Народний аматорський ансамбль бального танцю «Роксолана». Керівник: Галковська Катерина Миколаївна",
        "10. Народний аматорський ансамбль танцю «ДІАМАНТ». Керівник: Бондар Олександр Дем’янович"
    ],
    "черкаська": [
        "1. Народний аматорський ансамбль української пісні «Веселка». Керівник: Супрун Наталія Василівна",
        "2. Народний аматорський вокальний ансамбль «ЖАЙВІР». Керівник: Іщенко Іван Сергійович",
        "3. Народний аматорський театр хореографічних мініатюр «АРТАНІЯ». Керівник: Рубан Анатолій Вікторович",
        "4. Зразковий аматорський колектив сучасної хореографії «ІМПУЛЬС». Керівник: Воронова Олена Володимирівна",
        "5. Народний аматорський ансамбль бального танцю «АЛЕГРО». Керівник: Неверовський Анатолій Миколайович",
        "6. Народний аматорський хореографічний колектив «ІМПУЛЬС+». Керівник: Воропай Людмила Миколаївна",
        "7. Зразкова аматорська вокальна студія «ДоМіСолька». Керівник: Жуленьова Марина Сергіївна (ПРИСВОЄНО)",
        "8. Зразкова аматорська студія східного танцю «GUNES». Керівник: Саннікова Наталія Євгеніївна (ПРИСВОЄНО)"
    ],
    "чигиринська": [
        "1. Народний аматорський хор. Керівник: Тараненко Яків Іванович",
        "2. Народне аматорське вокальне тріо «НАМИСТО». Керівник: Шнабський Олег Миколайович",
        "3. Народний аматорський гурт української пісні «КАЛИНА» (с. Тіньки). Керівник: Каваценко Ніна Петрівна",
        "4. Народний аматорський вокальний ансамбль «РОДИНА» (с. Трушівці). Керівник: Зубенко Валентина Олексіївна",
        "5. Народний аматорський духовий оркестр. Керівник: Дерновий Антон Віталійович",
        "6. Аматорський інструментальний ансамбль «ТІНЧАНСЬКІ МУЗИКИ» (с. Тіньки). Керівник: Костенко Іван Петрович",
        "7. Народний аматорський театр. Керівник: Перевізник Світлана Іванівна",
        "8. Народний аматорський театр малих форм. Керівник: Гришко Світлана Іванівна",
        "9. Зразковий аматорський хореографічний колектив «Либідь». Керівник: Владикіна Марина Володимирівна",
        "10. Зразковий аматорський хореографічний колектив «ЕКСКЛЮЗИВ» (с. Тіньки). Керівник: Костенко Лариса Іванівна"
    ]
};
