/**
 * collectives-bitva.js - Офіційний реєстр учасників
 */
window.collectivesDatabase = {
    "smila": {
        "name": "Духовий оркестр «Божидар»",
        "institution": "Смілянська ДМШ №2",
        "leader": "Владислав Сірий",
        "location": "смілянська"
    },
    "zveny": {
        "name": "Оркестр духових інструментів",
        "institution": "Звенигородський Центр культури і дозвілля ім. Т. Шевченка",
        "leader": "Володимир Дзеціна",
        "location": "звенигородська"
    },
    "kamyanka": {
        "name": "Духовий ансамбль",
        "institution": "Будинок культури Кам’янської громади",
        "leader": "Володимир Кравець",
        "location": "кам’янська"
    },
    "talne": {
        "name": "Народний аматорський духовий оркестр «Сурми Тальнівщини»",
        "institution": "Центр культурних послуг Тальнівської міської ради",
        "leader": "Володимир Таран",
        "location": "тальнівська"
    },
    "hrist": {
        "name": "Духовий оркестр",
        "institution": "Великосевастянівський БК (Христинівська громада)",
        "leader": "Віталій Сверблик",
        "location": "христинівська"
    },
    "vodogray": {
        "name": "Народний аматорський естрадно-духовий ансамбль «Водограй»",
        "institution": "Великоканівецький СБК (Чорнобаївська ТГ)",
        "leader": "Павло Лещенко",
        "location": "золотоніська"
    }
};
