const hromadasGeoJSON = {
  "type": "FeatureCollection",
  "features": [
   {
      "name": "Бабанська",
      "x": 236,
      "y": 641
    },
    {
      "name": "Балаклеївська",
      "x": 553,
      "y": 414
    },
    {
      "name": "Баштечківська",
      "x": 197,
      "y": 420
    },
    {
      "name": "Березняківська",
      "x": 628,
      "y": 425
    },
    {
      "name": "Бобрицька",
      "x": 459,
      "y": 178
    },
    {
      "name": "Будищенська",
      "x": 590,
      "y": 309
    },
    {
      "name": "Бужанська",
      "x": 300,
      "y": 419
    },
    {
      "name": "Буцька",
      "x": 221,
      "y": 442
    },
    {
      "name": "Білозірська",
      "x": 550,
      "y": 361
    },
    {
      "name": "Ватутінська",
      "x": 401,
      "y": 503
    },
    {
      "name": "Великохутірська",
      "x": 637,
      "y": 155
    },
    {
      "name": "Виноградська",
      "x": 258,
      "y": 394
    },
    {
      "name": "Водяницька",
      "x": 305,
      "y": 467
    },
    {
      "name": "Вознесенська",
      "x": 669,
      "y": 214
    },
    {
      "name": "Вільшанська",
      "x": 442,
      "y": 424
    },
    {
      "name": "Гельмязівська",
      "x": 585,
      "y": 163
    },
    {
      "name": "Городищенська",
      "x": 496,
      "y": 408
    },
    {
      "name": "Дмитрушківська",
      "x": 209,
      "y": 579
    },
    {
      "name": "Драбівська",
      "x": 640,
      "y": 120
    },
    {
      "name": "Жашківська",
      "x": 137,
      "y": 441
    },
    {
      "name": "Звенигородська",
      "x": 356,
      "y": 448
    },
    {
      "name": "Золотоніська",
      "x": 640,
      "y": 265
    },
    {
      "name": "Зорівська",
      "x": 697,
      "y": 175
    },
    {
      "name": "Іваньківська",
      "x": 233,
      "y": 499
    },
    {
      "name": "Іркліївська",
      "x": 723,
      "y": 300
    },
    {
      "name": "Кам’янська",
      "x": 630,
      "y": 511
    },
    {
      "name": "Канівська",
      "x": 488,
      "y": 229
    },
    {
      "name": "Катеринопільська",
      "x": 374,
      "y": 547
    },
    {
      "name": "Корсунь-Шевченківська",
      "x": 413,
      "y": 326
    },
    {
      "name": "Ладижинська",
      "x": 177,
      "y": 681
    },
    {
      "name": "Леськівська",
      "x": 691,
      "y": 382
    },
    {
      "name": "Лип’янська",
      "x": 482,
      "y": 574
    },
    {
      "name": "Лисянська",
      "x": 318,
      "y": 395
    },
    {
      "name": "Ліплявська",
      "x": 521,
      "y": 189
    },
    {
      "name": "Маньківська",
      "x": 184,
      "y": 513
    },
    {
      "name": "Матусівська",
      "x": 516,
      "y": 475
    },
    {
      "name": "Медведівська",
      "x": 707,
      "y": 431
    },
    {
      "name": "Михайлівська",
      "x": 653,
      "y": 449
    },
    {
      "name": "Мліївська",
      "x": 511,
      "y": 353
    },
    {
      "name": "Мокрокалигірська",
      "x": 424,
      "y": 563
    },
    {
      "name": "Монастирищенська",
      "x": 70,
      "y": 477
    },
    {
      "name": "Мошнівська",
      "x": 528,
      "y": 276
    },
    {
      "name": "Набутівська",
      "x": 477,
      "y": 323
    },
    {
      "name": "Новодмитрівська",
      "x": 625,
      "y": 223
    },
    {
      "name": "Паланська",
      "x": 151,
      "y": 614
    },
    {
      "name": "Піщанська",
      "x": 568,
      "y": 205
    },
    {
      "name": "Ротмістрівська",
      "x": 551,
      "y": 483
    },
    {
      "name": "Руськополянська",
      "x": 595,
      "y": 355
    },
    {
      "name": "Сагунівська",
      "x": 738,
      "y": 390
    },
    {
      "name": "Селищенська",
      "x": 431,
      "y": 372
    },
    {
      "name": "Смілянська",
      "x": 600,
      "y": 423
    },
    {
      "name": "Стеблівська",
      "x": 375,
      "y": 362
    },
    {
      "name": "Степанецька",
      "x": 624,
      "y": 375
    },
    {
      "name": "Степанківська",
      "x": 441,
      "y": 275
    },
    {
      "name": "Тальнівська",
      "x": 276,
      "y": 528
    },
    {
      "name": "Тернівська",
      "x": 583,
      "y": 484
    },
    {
      "name": "Уманська",
      "x": 172,
      "y": 608
    },
    {
      "name": "Христинівська",
      "x": 104,
      "y": 573
    },
    {
      "name": "Червонослобідська",
      "x": 658,
      "y": 371
    },
    {
      "name": "Черкаська",
      "x": 638,
      "y": 339
    },
    {
      "name": "Чигиринська",
      "x": 788,
      "y": 454
    },
    {
      "name": "Чорнобаївська",
      "x": 738,
      "y": 229
    },
    {
      "name": "Шевченківська",
      "x": 395,
      "y": 428
    },
    {
      "name": "Шполянська",
      "x": 472,
      "y": 513
    },
    {
      "name": "Шрамківська",
      "x": 652,
      "y": 60
    },
    {
      "name": "Єрківська",
      "x": 371,
      "y": 505
    }
     ]
};
